Repository: techies23/Inactive-Logout
Catalog: lang/ina-logout-*.po
Languages: fi

source: Inactive User Logout Settings
fi: Inactive User Logout -asetukset

source: You have been logged out because of inactivity.
fi: Sinut on kirjattu ulos koska et ollut aktiivinen.

source: Reset advanced settings successfull.
fi: Lisäasetusten nollaus onnistui.

source: Minute(s)
fi: Minuutti(a)

source: Sorry, Inactive User Logout requires WordPress %s or higher. Please upgrade your WordPress install.
fi: Pahoitteluni, Inactive User Logout vaatii WordPress-version %s tai sitä suuremman. Päivitä WordPress-asennuksesi.

source: Sorry, Inactive User Logout requires PHP %s or higher. Talk to your Web host about moving you to a newer version of PHP.
fi: Pahoitteluni, Inactive User Logout vaatii PHP-version %s tai sitä suuremman. Juttele palveluntarjoajallesi PHP:n päivittämisestä uudempaan versioon.

source: Continue
fi: Jatka sisäänkirjautuneena

source: Session Timeout
fi: Fillarillasta loppui vauhti kesken

source: Updated !
fi: Päivitetty!

source: Dismiss this notice.
fi: Piilota tämä ilmoitus.

source: Like this plugin ?
fi: Pidätkö tästä lisäosasta?

source: Please consider giving a %s if you found this useful at wordpress.org.
fi: Harkitsethan %s jos pidit tätä hyödyllisenä.

source: Basic Management
fi: Perusasetukset

source: Advanced Management
fi: Lisäasetukset

source: Support
fi: Tuki

source: Contribute !
fi: Osallistu lisäosan kehitykseen!

source: Multi-Role Timeout
fi: Roolipohjainen aikakatkaisu

source: This will enable multi-user role timeout functionality.
fi: Tämä ottaa käyttöön roolipohjaiset aikakatkaisuasetukset.

source: Enable Multi-User Feature
fi: Ota käyttöön roolipohjainen ominaisuus.

source: This will allow you to define different timeout constraint according to different selected user roles.
fi: Tämä mahdollistaa eri aikakatkaisuasetusten asettamisen käyttäjäroolin perusteella.

source: User Role
fi: Käyttäjärooli

source: Timeout (In Minutes)
fi: Aikakatkaisu (minuutteina)

source: Redirect Page
fi: Uudelleenohjaussivu

source: Disable
fi: Poista käytöstä

source: Disable Concurrent Login
fi: Estä samanaikainen sisäänkirjautuminen

source: Set Global Redirect Page
fi: Aseta globaali uudelleenohjaussivu

source: No Posts Found.
fi: Artikkeleita ei löytynyt.

source: Note: %s is used for disabling inactive logout functionality to that specific user.
fi: Huom: %s käytetään aikakatkaisutoiminnon disablointiin kyseiselle käyttäjälle.

source: Save Changes
fi: Tallenna muutokset

source: Are you sure you want to erase all advanced settings. This cannot be undone !
fi: Oletko varma, että haluat nollata kaikki lisäasetukset? Toimintoa ei voi peruuttaa!

source: Reset Advanced Settings !
fi: Nollaa lisäasetukset!

source: Idle Timeout
fi: Aikakatkaisu

source: Idle Message Content
fi: Aikakatkaisun yhteydessä näytettävä viesti

source: Message to be shown when idle timeout screen shows.
fi: Viesti näytetään kun määritelty aika täyttyy.

source: Popup Background
fi: Ponnahdusikkunan tausta

source: Choose a background color to hide after logout. Enabling this option will remove tranparency.
fi: Valitse taustaväri. Tämän asetuksen käyttöönotto poistaa läpinäkyvyyden.

source: Popup Background Color
fi: Ponnahdusikkunan taustaväri.

source: Choose a popup background color.
fi: Valitse taustaväri.

source: Disable Timeout Countdown
fi: Poista aikakatkaisun varoaika.

source: When timeout popup is shown user is not logged out instantly. It gives user a chance to keep using or logout for 10 seconds. Remove this feature and directly log out after inactive.
fi: Kun käyttäjälle näytetään ilmoitus aikakatkaisusta, häntä ei kirjata ulos välittömästi. Tämä antaa 10 sekunnin ajan vielä mahdollisuuden pysyä sisäänkirjautuneena tai kirjautua ulos. Poista tämä toiminto jos haluat että käyttäjä kirjataan ulos välittömästi ajan umpeuduttua.

source: Show Warn Message Only
fi: Näytä vain varoitusviesti.

source: Will show warn message without logout url but user will not log out.
fi: Näytetään varoitusviesti mutta käyttäjää ei kirjata ulos.

source: Please note ! Multi role timeout feature will not work when this setting is enabled. Similarly, idle Message Content will be ignored and replaced with this content.
fi: Huom. Käyttäjärooleihin pohjautuva aikakatkaisutoiminto ei toimi jos tämä asetus on käytössä.

source: Warn Message Content
fi: Varoitusviestin sisältö.

source: Use {wakup_timout} to show minutes. This is message that will be shown when inactive.
fi: Käytä {wakup_timout} minuuttien näyttämiseen. Tämä viesti näytetään kun käyttäjä ei ole aktiivinen.

source: Disable Concurrent Logins
fi: Estä samanaikainen kirjautuminen

source: This will unable user to login using same account in different places.
fi: Tämä estää käyttäjän kirjautumisen samalle tilille monesta paikasta.

source: Enable Redirect
fi: Ota käyttöön uudelleenohjaus

source: If not checked then user will be logged out to login screen after timeout.
fi: Oletusarvoisesti käyttäjä ohjataan sisäänkirjautumisnäkymään aikakatkaisun jälkeen.

source: External Page Redirect
fi: Ulkoinen uudelleenohjaus

source: Select a page to redirect to after session timeout and clicking OK.
fi: Valitse sivu, johon käyttäjä ohjataan uloskirjaamisen jälkeen.

source: Custom URL Redirect
fi: Oma URL-osoite

source: Link to custom url redirect. Ex: %s
fi: Mukautettu URL-ohjaus. Esim: %s

source: Inactive logout provides functionality to log out any idle users defined specified time showing a message. Works for frontend as well.
fi: Inactive logout mahdollistaa käyttäjien uloskirjaamisen määritellyn ajan jälkeen. Toimii myös sivuston julkisella puolella.
